app/controllers/counselors_controller.rb

SELECT "counselors".* FROM "counselors"
---
  def index
    @counselors = Counselor.all

INSERT INTO "counselors" ("first_name", "last_name", "image", "occ_title", "occ_state", "payment", "agreement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @counselor = Counselor.new(counselor_params)

    respond_to do |format|
      if @counselor.save

UPDATE "counselors" SET "first_name" = ?, "last_name" = ?, "age" = ?, "zipcode" = ?, "ssn" = ?, "occ_title" = ?, "occ_state" = ?, "payment" = ?, "agreement" = ?, "updated_at" = ? WHERE "counselors"."id" = ?
---
  def update
    respond_to do |format|
      if @counselor.update(counselor_params)

SELECT  "counselors".* FROM "counselors" WHERE "counselors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_counselor
      @counselor = Counselor.find(params[:id])