app/controllers/rooms_controller.rb

  def show
    @messages = Message.all
---
SELECT "messages".* FROM "messages"