app/controllers/sessions_controller.rb

  def create
    # if user exists and matches in database:
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "adam@test.com"], ["LIMIT", 1]]