app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "password") VALUES (?, ?, ?, ?)  [["created_at", "2017-12-30 00:01:28.076354"], ["updated_at", "2017-12-30 00:01:28.076354"], ["email", "adamwhite82@gmail.com"], ["password", "123456"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 102], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "bogey@test.com"], ["password_digest", "$2a$10$x9oQ9Z.AMVmzJ8M3of1YJ.GEzQGleG/5A8lNMGEA5AoQEP8hQ3a4O"], ["updated_at", "2018-01-09 02:54:59.066926"], ["id", 102]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)